[
    {
        "id": 27,
        "title": "FG begins roll out of free 1m gas cylinders to boost clean cooking",
        "description": "<p><strong>By Obas Esiedesa, Abuja</strong></p><p><strong><br></strong></p><p>As part of its effort to&#160;promote clean cooking energy for families across the country, the Federal Government, FG, yesterday commenced the free distribution of gas cylinders with a target of moving at least one million homes to clean cooking gas by 2030.</p><p><br></p><p><span>The programme, which is under the &#8216;Decade of Gas&#8217; initiative, tagged LPG grassroots penetration, is expected to distribute about 250,000 gas cylinders to women in rural communities across the country.</span><br></p><p><span><br></span></p><p><span>Speaking at the flag-off of the programme in the Apo Resettlement area of Abuja, the Minister of State for Petroleum Resources (Gas), Ekperikpe Ekpo, said the administration was determined to increase domestic gas usage.</span><span><br></span></p><p><span><br></span></p><p><span>Credit to:&#160;</span><a href=\"https://www.vanguardngr.com/2024/05/fg-begins-roll-out-of-free-1m-gas-cylinders-to-boost-clean-cooking/\">vanguardngr.com</a></p><p><br></p><p><a href=\"https://www.vanguardngr.com/2024/05/fg-begins-roll-out-of-free-1m-gas-cylinders-to-boost-clean-cooking/\" target=\"_blank\"><b>Read More</b></a><br></p>",
        "short_description": "As part of its effort to promote clean cooking energy for families across the country, the FG…",
        "image_thumbnail": "public/fileupload/7KrdAld5EshN09lm3MofCwqGBH73URx1HZGQodeL.webp",
        "views_count": 0,
        "notes": null,
        "slug": "fg-begins-roll-out-of-free-1m-gas-cylinders-to-boost-clean-cooking",
        "display_status": "Published",
        "created_at": "2024-05-30 13:17:49",
        "updated_at": "2024-05-30 13:17:49"
    },
    {
        "id": 26,
        "title": "LPG Penetration Gets Boost as $25m Triansel Gas Terminal Reaches 90% Completion",
        "description": "<p>With project construction now at 90 per cent completion level, the 156,000 metric tons per annum Triansel Gas Limited&#8217;s Liquefied Petroleum Gas (LPG) storage terminal in Koko, Delta State, will be inaugurated for full operation towards the end of 2024, to further boost domestic penetration of the product in Nigeria.</p><p><br></p><p>The $25 million Triansel Gas project is a joint venture between its parent company, Chimons Gas Limited and the Nigeria Content Development and Monitoring Board (NCDMB) at equity stakes of 59.1 per cent and 40.9 per cent, respectively. The local content agency invested $3.4 million in the project.</p><p><br></p><p><b>Credit to:&#160; &#160;&#160;</b><span>thisdaylive</span></p><p><font color=\"#121212\" face=\"Open Sans, sans-serif\"><span><b><br></b></span></font></p><p><a href=\"https://www.thisdaylive.com/index.php/2024/05/07/lpg-penetration-gets-boost-as-25m-triansel-gas-terminal-reaches-90-completion\" target=\"_blank\"><b>Continue Reading...</b></a><br></p><p><a href=\"https://www.thisdaylive.com/index.php/2024/05/07/lpg-penetration-gets-boost-as-25m-triansel-gas-terminal-reaches-90-completion\" target=\"_blank\">https://www.thisdaylive.com/index.php/2024/05/07/lpg-penetration-gets-boost-as-25m-triansel-gas-terminal-reaches-90-completion</a><font color=\"#121212\"><br></font></p>",
        "short_description": "With project construction now at 90 per cent completion level",
        "image_thumbnail": "public/fileupload/QnksEUOjrd9N9SkG9YD5ab1EyMCbdQ9qWTEJqW5T.png",
        "views_count": 0,
        "notes": null,
        "slug": "lpg-penetration-gets-boost-as-25m-triansel-gas-terminal-reaches-90-completion",
        "display_status": "Published",
        "created_at": "2024-05-08 19:59:43",
        "updated_at": "2024-05-08 20:02:46"
    },
    {
        "id": 24,
        "title": "LPG infrastructure is already available across Nigeria – Felix Ekundayo",
        "description": "<div>The government is taking steps to develop compressed natural gas (CNG) infrastructure across the country, to create alternatives to petrol which has increased at the pump since fuel subsidies were removed. In the end, Nigerians are meant to benefit from cheaper CNG.</div><div><br></div><div>Aside from addressing gas supply issues in the country, some stakeholders have said the government should have varied gas-based alternatives across the country, so Nigerians can convert and make use of the gas type that is readily available to them.</div><div><br></div><div>Recently, Nairametrics reached out to Felix Ekundayo, the President of the Nigeria Liquefied Petroleum Gas Association (NLPGA) to gain some insight into the possible conversion of vehicles, vans, keke napeps, lorries, and generators, to LPG.</div><div><br></div><div><br></div><h4><b>Credit:</b>&#160; nairametrics.com</h4><h4><span><a href=\"https://nairametrics.com/2023/08/29/lpg-infrastructure-is-already-available-across-nigeria-felix-ekundayo/\" target=\"_blank\"><b>Continue Reading</b></a>&#160;</span></h4>",
        "short_description": "The government is taking steps to develop compressed natural gas (CNG) infrastructure across the country",
        "image_thumbnail": "public/fileupload/T6qkrfAEx2RLLqYDGd2F2p77xzfZTOyWJPmyYh2X.png",
        "views_count": 0,
        "notes": null,
        "slug": "lpg-infrastructure-is-already-available-across-nigeria-felix-ekundayo",
        "display_status": "Published",
        "created_at": "2023-08-31 17:59:51",
        "updated_at": "2023-08-31 17:59:51"
    },
    {
        "id": 18,
        "title": "LPG ACCIDENT REPORTING – FEBRUARY 2017",
        "description": "The vapor inlet line of an LPG truck broke while the truck was in motion however the internal shut-off valve ensured that the product remained intact reiterating the importance of the EVS in LPG trucks.",
        "short_description": "The vapor inlet line of an LPG truck broke while the truck was in motion",
        "image_thumbnail": "public/fileupload/B7OXlrmMmhH0z8quVktO0zilzt3Fs6iIy5MrowRP.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "lpg-accident-reporting-february-2017",
        "display_status": "Published",
        "created_at": "2023-07-09 13:56:20",
        "updated_at": "2023-07-16 16:52:25"
    },
    {
        "id": 17,
        "title": "THE POLLUTION IN THE HOUSE",
        "description": "<div>This proposed program, Ujjwala-Mamta, meaning bright motherhood, is proposed to be a follow on or supplement to the highly successful Pradham Mantri Ujjwala Yojana program started last May, which has already provided LPG connections to 17 million poor households and is on track to achieve a goal of 50 million by 2019.&#160; &#160;This on top of the 12.5 million from the Give it Up campaign from the year before. Now we need to find ways to focus on enhancing usage among the most vulnerable, such as pregnant women.</div><div><br></div><div>Air pollution kills more Indians than any other risk factor with estimates ranging from 15 to 20 lakh premature deaths annually. Although outdoor air pollution garners most public attention, it is well-known in health circles that pollution from chulhas is about half of the problem because people in households are directly exposed to such pollution. It is less well-understood, however, that the two are linked: One of the reasons India has such bad outdoor air pollution is that nearly 200 million households are still burning biomass every day for cooking. Solving the household dirty fuel problem will also help reduce the outdoor air problem, although not solve it on its own.</div><div><br></div><div>Although reducing outdoor air pollution remains difficult for Indian policymakers given the multiplicity of sources involved, the country is making major strides in addressing household air pollution. First with the Give it Up scheme and now with the Pradhan Mantri Ujjwala Yojana (PMUY) programme, the Ministry of Petroleum and Natural Gas (MoPNG) has targeted 5 crore BPL households to be connected to LPG by 2019, a massive increase in the rate of uptake by historical and global standards. Discussions are on to double the target for early next decade. This would mean a remarkable enhancement of clean kitchens for hundreds of millions of people. But accomplishing the project will involve major challenges.</div><div><br></div><div>An LPG connection is a necessary first step, but there is need to ensure usage as well. An LPG connection alone does not help health much if the cylinder and stove sit unused in a corner, and are used occasionally for making tea. A near-full transition to LPG as the main cook fuel is needed to stop the household and ambient pollution from traditional biomass use. Although experience from all over the world shows that gas is a superior and aspirational fuel and that households can reasonably be expected to eventually shift to using it, there has not been much experience in creating the incentives for poor households to move quickly through the transition. Cost is certainly an issue, but for hundreds of millions in India, other issues are also important, such as reliable and rapid access to refills, clear messaging around health, and changes in community expectations.</div><div><br></div><div>The health sector has long dealt with these issues. It does no good just to give people access to latrines, condoms, birth facilities, and vaccines, if no one uses them. As with LPG, access is essential, but that is just the beginning to secure health benefits. Thus, in the next stages of the LPG programme there would be real advantage if the two sectors, petroleum and health, were to work together to make sure LPG makes its full contribution of health &#8212; the former to provide access and the latter to help ensure usage.</div><div><br></div><div>One arena with which India&#8217;s health sector has good experience is conditional cash transfer (CCT) or the provision of cash incentives for specific behaviors that promote health in vulnerable groups &#8212; one such project is the Shishu Suraksha Karyakram (JSSK) programme among poor pregnant women. It has recently been expanded under the Pregnancy Aid Yojana scheme to provide a minimum of Rs 6,000 in incentives for healthy practices during pregnancy in poor households. There are risks with this approach, of course, but it works well if the funds are reserved for producing highly-effective behavioral changes that do not result in long-term financial commitments and, importantly, are transferred directly to the women&#8217;s bank accounts where they are most likely to be used for the benefit of the household.</div><div><br></div><div>There is a parallel opportunity for LPG use &#8212; to initiate a sub-programme of the PMUY that focuses on providing not only LPG connections but refills during pregnancy to all biomass-using households. The impact on birth weight and other adverse birth outcomes for a pregnant woman using biomass has been established in several studies in India; a recent study in Africa shows reduction in hypertension in pregnancy with clean fuel use. Thus the Rs 1,800 or so that the LPG would cost during a pregnancy to maximise the reduction in biomass smoke looks to be well worth the cost for the country. The project could be supported by the upgraded JSSK programme.</div><div><br></div><div>Such a joint effort between MoPNG and the Ministry of Health and Family Welfare (MoHFW) to promote the health and well-being of poor pregnant women &#8212; and by extension, their newborn children &#8212; could serve as a model for future collaborative efforts that might be undertaken by the MoHFW to address other pressing sources of air pollution. Such innovative partnerships are required to address India&#8217;s complex development challenges.</div><div><br></div><div>Written by <b>Kirk R. Smith</b> and <b>Ambuj D. Sagar</b> , Indian Express, Feb 17, 2017</div><div><br></div><div><i>Smith is professor of global environmental health at the University of California, Berkeley and Sagar is Vipula and Mahesh Chaturvedi Professor of Policy Studies at IIT Delhi</i></div><div><br></div>",
        "short_description": "This proposed program, Ujjwala-Mamta, meaning bright motherhood",
        "image_thumbnail": "public/fileupload/ICoptDuY0AJ1utmbkcwTw9RI4YspUhFy3SCqdIEj.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "the-pollution-in-the-house",
        "display_status": "Published",
        "created_at": "2023-07-09 13:54:57",
        "updated_at": "2023-07-16 16:51:22"
    },
    {
        "id": 16,
        "title": "SAFETY TIPS FOR DRIVING",
        "description": "<div>1. Before driving a vehicle, minimize blind spots by adjusting the left and right side mirrors until you can see the tip of the rear bumper in the lower corner of each mirror.</div><div><br></div><div>2. No need to speed. Plan ahead so you leave yourself plenty of time for safe travel</div><div><br></div><div>3. Get in the habit of turning on your headlights when you turn on your windshield wipers for driving in the rain. This will help make your vehicle more visible to others.</div><div><br></div><div>4. When parking, drive into a pull-through parking spot (if available), to eliminate the need for backing. Don&#8217;t race for a parking space. Follow parking lot speed limits or, if no limit is posted, slow down anyway to allow safer reaction to unexpected occurrences.</div><div><br></div><div>5. Don&#8217;t cut diagonally across parking lots. Drive in designated traffic lanes and directions. Turn off radios and other electronic devices to prevent distractions when driving in parking lots. This will help you stay fully alert for pedestrians, bicycles, light posts, and other vehicles.</div><div><br></div><div>6. Don&#8217;t pump the brakes if your car has an anti-lock brake system (ABS) because pumping will disengage the anti-lock system. When the ABS is activated, it automatically pumps the brakes for you so don&#8217;t be alarmed if you feel the pedal pulsations or vibrations. Always &#8220;brake and steer&#8221; when using four-wheel ABS.</div><div><br></div><div>7. Don&#8217;t slam on the brakes if you have a blowout on the highway. Take your foot off the gas pedal to let the car slow down gradually and steer your vehicle towards an exit, the shoulder, or other safe location (using directional signals, if needed).</div><div><br></div><div>8. Be seen-be safe. Wear a high-visibility vest each time you exit your truck in the company yard, at your customers dock, and on the side of the road.&#160;</div>",
        "short_description": "Learn safety tips for driving",
        "image_thumbnail": "public/fileupload/0krGprnANARRXFVhGWWI4V9dAQX5mNlGgxsjOaKY.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "safety-tips-for-driving",
        "display_status": "Published",
        "created_at": "2023-07-09 13:47:56",
        "updated_at": "2023-07-16 16:49:51"
    },
    {
        "id": 15,
        "title": "2017 LPG SAFETY TRAINING & CERTIFICATION",
        "description": "<div>Registration has opened for the 2017 NLPGA LPG Safety &amp; Certification training program for Truck Drivers, Plant Operators / Supervisors, Domestic Installers, including the training on Safe Installation and Operation of LPG Conversion Kits for Gasoline Generators. These training sessions are scheduled to kick off in May / June 2017 at the following locations - Lagos, Abuja, Kano, Onitsha, Calabar and Onitsha.</div><div><br></div>",
        "short_description": "Registration has opened for the 2017 NLPGA LPG Safety & Certification training program",
        "image_thumbnail": "public/fileupload/vrWDPCFu4dUFzlSyXvardNeXuHIUNJHvNqF3mgS7.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "2017-lpg-safety-training-certification",
        "display_status": "Published",
        "created_at": "2023-07-09 13:45:38",
        "updated_at": "2023-07-16 16:48:08"
    },
    {
        "id": 14,
        "title": "NLPGA (ABUJA CHAPTER) HOLDS SENSITIZATION WORKSHOP FOR NSCDC (FCT) OFFICIALS",
        "description": "<div>The NLPGA (Abuja Chapter) Sensitisation Workshop for Officers and Men of the Nigerian Securities and Civil Defence Corp (NSCDC) FCT Command was held on Monday, 20th February, 2017.&#160;</div><div><br></div><div><br></div><div>Chief Femi Sanni, NLPGA Interim Chairman (Abuja Chapter) gave the opening remarks on the need for the NSCDC to ensure the enforcement of LPG safety regulations within the FCT.</div><div>&#160;</div><div><br></div><div>Engr. Dr. Magose Abraham Eju gave the main presentation on SAFE LPG where he educated the audience on the properties of LPG and the potential hazards. He further explained the need for all stakeholders in the Sector to work together to ensure the safe use of LPG, most especially as the Federal Government was planning to roll-out policies to increase the usage of LPG in the energy mix of households in the Country.</div><div><br></div><div>&#160;</div><div>The NSCDC FCT Commandant, Patrick E. Ukpan, in his response was full of appreciation to the Abuja Chapter, for the program and promised to continue collaborating with the Association with regards to the enforcement of LPG regulations.</div>",
        "short_description": "The NLPGA (Abuja Chapter) Sensitisation Workshop for Officers and Men of the Nigerian Securities and Civil Defence Corp (NSCDC) FCT Command",
        "image_thumbnail": "public/fileupload/Zn4OpYJyM1gektEGf0TkgRMOIoqL6rfwq1xHRjLo.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "nlpga-abuja-chapter-holds-sensitization-workshop-for-nscdc-fct-officials",
        "display_status": "Published",
        "created_at": "2023-07-09 13:43:36",
        "updated_at": "2023-07-16 16:46:56"
    },
    {
        "id": 13,
        "title": "THE INDIA ‘GIVE IT UP’ CAMPAIGN",
        "description": "<div>More than 1 crore LPG consumers have given up their cooking gas subsidies in one year since Prime Minister Narendra Modi made a call to the well-heeled to give up the same.</div><div><br></div><div>Since Modi made the appeal in March last year, 10,006,303 LPG consumers have stopped using subsidised cooking gas, helping the exchequer save a thousand crores of rupees</div><div><br></div><h4><b>Read More</b></h4><div><br></div><div><a href=\"http://economictimes.indiatimes.com/industry/energy/oil-gas/give-it-up-over-1-crore-lpg-users-gave-up-their-subsidies/articleshow/51929960.cms.\" target=\"_blank\">http://economictimes.indiatimes.com/industry/energy/oil-gas/give-it-up-over-1-crore-lpg-users-gave-up-their-subsidies/articleshow/51929960.cms.</a><br></div>",
        "short_description": "More than 1 crore LPG consumers have given up their cooking gas subsidies in one year since Prime Minister Narendra Modi made a call",
        "image_thumbnail": "public/fileupload/CGYcG1MT0DxrCFAjICQaYpqBDsF1hkvIWAtAXjPw.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "the-india-give-it-up-campaign",
        "display_status": "Published",
        "created_at": "2023-07-09 13:41:09",
        "updated_at": "2023-07-16 16:45:50"
    },
    {
        "id": 12,
        "title": "PUBLIC NOTICE",
        "description": "<div>THE MEMBERS OF NIGERIA LIQUEFIED PETROLEUM GAS ASSOCIATION (NLPGA) AND THE GENERAL PUBLIC ARE BY THIS NOTICE HEREBY INFORMED THAT MR. JOSEPH EROMOSELE WHOSE PHOTOGRAPH APPEARS ABOVE HAS BEEN TERMINATED. HE IS NO LONGER A CONSULTANT AND THE EXECUTIVE SECRETARY OF THE ASSOCIATION.</div><div><br></div><div>BY THIS NOTICE THE EXECUTIVE COMMITTEE AND GOVERNING COUNCIL OF THE NLPGA HEREBY DISSOCIATES ITSELF FROM MR. JOSEPH EROMOSELE. THE MEMBERS OF THE ASSOCIATION AND THE PUBLIC ARE HEREBY NOTIFIED NOT TO DEAL OR TRANSACT WITH THE SAID MR. JOSEPH EROMOSELE AS THE EXECUTIVE SECRETARY OF NIGERIA LIQUEFIED PETROLEUM GAS ASSOCIATION (NLPGA). THE ASSOCIATION CONFIRMS THAT MR JOSEPH EROMOSELE NO LONGER ACTS FOR THE ASSOCIATION IN ANY CAPACITY WHATSOEVER.</div><div><br></div><div>ANYONE WHO TRANSACTS OR DEALS WITH HIM DOES SO AT HIS/HER OWN RISK.</div><div><br></div><div>&#160;</div><div><br></div><div>SIGNED</div><div><br></div><div>EXECUTIVE COMMITTEE OF NLPGA</div>",
        "short_description": "THE MEMBERS OF NIGERIA LIQUEFIED PETROLEUM GAS ASSOCIATION (NLPGA) AND THE GENERAL PUBLIC",
        "image_thumbnail": "public/fileupload/WP6N2Cc04q7lSrdRrmJqTAOOrSZVLr6bS7Wf3k41.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "public-notice",
        "display_status": "Published",
        "created_at": "2023-07-09 13:39:08",
        "updated_at": "2023-07-16 16:44:33"
    },
    {
        "id": 11,
        "title": "AEG OFFICIAL STATEMENT",
        "description": "<div>With reference to several reports that have surfaced with respects to the postponement of the 5th Africa LPG Summit in Lagos, Nigeria, the AEG GROUP LTD would like to clarify that no monies were paid to the Nigeria Liquefied Petroleum Gas Association (NLPGA) as all monies were sent to the personal accounts of Joseph Eromosele.</div><div><br></div><div>Find full statement here.</div>",
        "short_description": "With reference to several reports that have surfaced with respects to the postponement of the 5th Africa LPG Summit in Lagos",
        "image_thumbnail": "public/fileupload/dH1nNTGDURUoAJjwTYNRKHKWuswlgIQDP0FFcIGH.png",
        "views_count": 0,
        "notes": null,
        "slug": "aeg-official-statement",
        "display_status": "Published",
        "created_at": "2023-07-09 13:37:09",
        "updated_at": "2023-07-16 16:43:19"
    },
    {
        "id": 10,
        "title": "NLPGA seeks full implementation of LPG policy",
        "description": "<div>The Nigeria Liquefied Petroleum Gas Association has highlighted the need to fully implement the national policy on LPG in a bid to boost the consumption of the commodity in the country.</div><div><br></div><div>The NLPGA President, Mr Nuhu Yakubu, who led his executive committee members and other industry leaders to meet with Vice President&#160; Yemi Osinbajo recently, said there was a need to address the challenges in LPG subsector.</div><div><br></div><div>&#160;</div><div>The meeting, according to a statement, focused on implementation strategies for the national LPG policy as approved by the Federal Executive Council.</div><div><br></div><div>The Vice President was said to have expressed commitment to work closely with the NLPGA to achieve full implementation of the policy to achieve its desired objectives, which include a reduction in domestic energy poverty across Nigeria.</div><div><br></div><div>The statement said, &#8220;Other issues discussed include lack of enforcement and lack of uniformity of enforcement, the duplicity of regulatory oversight and levies, the impact of organised touting and extortions on consumer retail price, matter arising from VAT waiver, and inland waterways accessibility.</div><div><br></div><div>&#8220;The forthcoming LPG Conference and Exhibition was discussed, and His Excellency, the Vice President, graciously accepted the invitation as a special guest of honour and keynote speaker at the conference scheduled for November 26 to 27, 2019 in Lagos, jointly organised with LPG Summit, international LPG conference organisers.&#8221;</div><div><br></div><div>The Executive Secretary, NCDMB, Mr Simbi Wabote, who noted that the country had not made the most of the LPG in the country, said coastal LPG storage capacity had increased in recent years.</div><div><br></div><div>He said, &#8220;What we have seen in recent times is that the number of coastal depots has increased significantly, and the price of LPG had reduced within the coast.</div><div><br></div><div>&#8220;There is no significant depot anywhere in the country; all the inland facilities we have are just within filling stations. Those are not depots; they are more or less mini tanks. There is a huge opportunity for LPG beyond the cooking gas part of it that we need maximise. So, I challenge your members to look at how we can have a significant depot up north. If there is a business proposition in that direction, we are going to look at it.&#8221;</div>",
        "short_description": "The Nigeria Liquefied Petroleum Gas Association has highlighted the need to fully implement the national policy on LPG in a bid to boost the consumption",
        "image_thumbnail": "public/fileupload/bjMx3eOppqgmO4JoNY6apSyqe0nJiWN2GHEfrGGO.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "nlpga-seeks-full-implementation-of-lpg-policy",
        "display_status": "Published",
        "created_at": "2023-07-09 13:35:28",
        "updated_at": "2023-07-16 16:41:46"
    },
    {
        "id": 9,
        "title": "FG affirms removal of VAT on cooking gas",
        "description": "<div>The Federal Government has confirmed the removal of Value Added Tax (VAT) on Liquefied Petroleum Gas (LPG) in Nigeria, otherwise known as cooking gas.</div><div><br></div><div><br></div><div>This means that the cost of LPG, commonly referred to as cooking gas, will be relatively stable, thus attracting many investors and users in the country.</div><div><br></div><div>The Chairman, Federal Inland Revenue Service, FIRS, who disclosed this at the stakeholders&#8217; meeting with Vice President Yemi Osinbajo, in Abuja, recently said the measure was targeted at growing the LPG sector.</div><div><br></div><div>The Federal Government had earlier in the year promised to remove VAT on cooking gas to encourage utilisation of the product in many households.</div><div><br></div><div>Osinbajo had explained that specifically, for household cooking, the present administration is targeting a 40 percent adoption rate (i.e. 13.8m households) in 5 years, and 73 percent adoption in 10 years (33.3m households).</div><div><br></div><div>&#8220;We believe that the sub-sector can create up to 2 million new direct and indirect jobs in Nigeria. Our determination to prioritise the LPG sector development culminated in the Federal Executive Council&#8217;s approval of the National Gas policy in 2017, with dedicated input for the enhancement of the LPG sub-sector. Our driving vision has been to transform the sub-sector from a commodity sector based on export to a value creation sector based on domestic utilisation and industrialisation,&#8221; he said.</div><div><br></div><div>The President, Nigeria Liquefied Petroleum Gas Association (NLPGA), Nuhu Yakubu said: &#8220;The Nigeria LP Gas Association is the umbrella body of all stakeholders in the LP Gas sector in Nigeria. The primary objective of the Association is to promote the use of LP Gas in Nigeria at affordable costs.</div><div><br></div><div>Findings by The Guardian had shown that LPG business will likely be boosted in Nigeria, as the Nigerian LNG Limited, a major local producer has indicated interest to increase supply, while demand for LPG is on the rise.</div><div><br></div><div>In a message obtained from its website, the company stated: &#8220;NLNG commenced the supply of Liquefied Petroleum Gas (LPG), otherwise known as cooking gas, to the domestic market in 2007 when refineries became challenged and supply was grossly inadequate. Since then, the issue of inadequate supply has become a thing of the past.</div><div><br></div><div>&#8220;The intervention, which is in line with company&#8217;s vision of helping to build a better Nigeria, has significantly contributed to the stimulation and development of the domestic LPG market in Nigeria and has effectively brought down the price of cooking gas from over N7, 000 in 2007 to less than N3, 500 per 12.5kg cylinder today.</div><div><br></div><div>&#8220;NLNG is committed to delivering 350,000 tonnes of LPG into the Nigerian market annually and has signed Sales and Purchase Agreements (SPAs) with fifteen off-takers (all Nigerian companies) for the lifting of LPG for the domestic market.&#8221;</div>",
        "short_description": "The Federal Government has confirmed the removal of Value Added Tax (VAT) on Liquefied Petroleum Gas",
        "image_thumbnail": "public/fileupload/cJgudZL3lGnZYnHN8NmnRPsVhDLyrsqV6M6IS8lQ.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "fg-affirms-removal-of-vat-on-cooking-gas",
        "display_status": "Published",
        "created_at": "2023-07-09 13:33:33",
        "updated_at": "2023-07-16 16:40:09"
    },
    {
        "id": 8,
        "title": "NLPGA to host Virtual conference on Accelerating Economic Recovery through Gas",
        "description": "<p><span>The Nigeria Liquefied Petroleum Gas Association (NLPGA) is set to host its 10th International Annual LPG Conference,&#160;on Friday, December 4, 2020. This year&#8217;s edition, which will be the first to be hosted virtually, due to the prevailing COVID-19 pandemic and in alignment with social distancing precautions, is themed&#160;&#8220;LPG: Pivoting Economic Recovery for Households and Industries in Nigeria and Africa&#8221;.</span></p><p><span><br></span></p><p><span>The discourse will focus on interrogating industry issues, proffering actionable and measurable solutions towards achieving an accelerated Post-COVID 19 economic recovery, with gas as a pivotal enabler.</span></p><p><span><br></span></p><p><span>The conference will converge, globally acclaimed thought leaders, critical decision-makers, and stakeholders in the LPG markets across Nigeria, Africa, and the world in both the private and the public sectors.</span></p><p><span><br></span></p><p><span>Speaking during the announcement of the international virtual conference,&#160;Nuhu Yakubu, President, Nigeria Liquified Petroleum Gas Association (NLPGA)&#160;stated that the conference&#8217;s objective is crucial to the overarching recovery-led goal of the economy following the pandemic and recent occurrences around the world.</span></p><p><span>&#8220;Owing to the economic upheavals experienced globally, it is the response of every forward-thinking organization to identify actions and amplify sector-driven solutions towards rebuilding the economy. This year&#8217;s theme, topics of discussion, speakers, and panelists were painstakingly selected to provide diverse, yet specific solutions targeted at adding the sector&#8217;s quota towards the economic build.&#8221;</span></p><p><span><br></span></p><p><span>In line with the 7th Sustainable Development Goals (SDGs), deepening the education of the role and domestic use of Liquefied Petroleum Gas (LPG) is critical as the world aims to provide clean, reliable, sustainable, and affordable energy sources for everyone by 2030. Beyond the affordability and safety benefits of LPG for households and industries, it is not far-fetched to state that the growing adoption of LPG will advertently result in economic growth through job and wealth creation.</span></p><p><span><br></span></p><p><span>Riding on the declaration of 2020 as the Year of Gas, by the Honourable Minister of State for Petroleum Resources, Chief Timipre Sylva, we align as an industry with this executive posturing to galvanize the entire LPG value chain to drive a groundswell adoption of LPG in spurring growth and improving the wellbeing of households across the African continent,&#8221; he added.</span></p><p><span><br></span></p><p><span>The conference&#8217;s programme includes keynote addresses, presentations, and panel discussions expected to be delivered by Nigeria&#8217;s Vice President, the Honourable Minister of State for Petroleum, Lagos State Honourable Commissioner, Ministry of Energy and Mineral Resources, The World LPG Association, Africa LPG Association and captains of industry who will significantly expound the global and local perspectives of the LPG market; its role in Nigeria&#8217;s accelerated recovery plan, adoption and acceptance strategies for LPG and identify funding opportunities for the gas value chain, among other insights.</span></p><p><span><br></span></p><p><span>For participation and sponsorship details please contact the Secretariat:&#160;<a href=\"mailto:olakunleoyebanjo@nigerialpgas.com\" rel=\"noopener noreferrer\" target=\"_blank\"><span><b>olakunleoyebanjo@nigerialpgas.com</b></span></a>&#160;or contact <b>08039789876, 0902 222 2226, 0818 253 7351</b> for further substantive information.</span></p>",
        "short_description": "The Nigeria Liquefied Petroleum Gas Association (NLPGA) is set to host its 10th International Annual LPG Conference",
        "image_thumbnail": "public/fileupload/Ls7fME4kMCtBnEaURlqCYlgFpxPm9QLmP6MQzKRC.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "nlpga-to-host-virtual-conference-on-accelerating-economic-recovery-through-gas",
        "display_status": "Published",
        "created_at": "2023-07-09 13:30:01",
        "updated_at": "2023-07-16 16:38:46"
    },
    {
        "id": 7,
        "title": "NLPGA set to host Nigeria and Africa at its 11th International Conference and Exhibition (2nd Virtual Edition)",
        "description": "<p><span>The Nigeria Liquefied Petroleum Gas Association (NLPGA) will host its 11th Annual LPG International Conference, on Thursday, November 25, 2021. This year&#8217;s edition, which will be the second to be hosted virtually, in alignment with social distancing precautions because of the prevailing COVID-19 pandemic. The conference is themed &#8216;Market Growth &amp; Fiscal Regulations: Rethinking the LPG Supply Gaps Amid the Challenging Regulatory Environment.&#8217;</span></p><p><span><br></span></p><p dir=\"ltr\"><span>The discourse will focus on interrogating industry issues, proffering actionable and measurable solutions towards achieving an accelerated economic recovery, with gas as a pivotal enabler.</span></p><p dir=\"ltr\"><span><br></span></p><p dir=\"ltr\"><span>The conference will converge globally acclaimed thought leaders, critical decision-makers, and stakeholders in the LPG markets across Nigeria and Africa, in both the private and the public sectors.</span></p><p dir=\"ltr\"><span><br></span></p><p dir=\"ltr\"><span>Speaking during the announcement of the virtual international conference, Nuhu Yakubu, President, Nigeria Liquified Petroleum Gas Association (NLPGA) stated that the conference&#8217;s aim is crucial to the overarching recovery-led goal of the economic policies of government in Africa and Nigeria in particular, following the recent challenges faced by the LPG sector.</span></p><p dir=\"ltr\"><span>&#8220;According to him, &#8216;it is the response of every forward-thinking organization to identify actions and amplify sector-driven solutions towards improving the economy. This year&#8217;s theme, topics of discussion, speakers, and panelists were painstakingly selected to provide diverse, yet specific solutions targeted at improving operating capacity in the LPG sector.&#8221;</span></p><p dir=\"ltr\"><span><br></span></p><p dir=\"ltr\"><span>In line with the 7th Sustainable Development Goals (SDGs), deepening the education on the role of diverse uses of Liquefied Petroleum Gas (LPG) is critical as the world aims to provide cleaner, reliable, sustainable and affordable energy sources for everyone by 2030. Despite the rising price of LPG, the overarching benefits of LPG for households and industries as a critical enabler cannot be overemphasized. Also, it is not far-fetched to state therefore that sustaining the growing adoption of LPG through policies and programs will advertently sustain economic growth through job and wealth creation.&#8221;</span></p><p dir=\"ltr\"><span><br></span></p><p dir=\"ltr\"><span>Riding on the declaration of the Decade of Gas, by the Honorable Minister of State for Petroleum Resources, Chief Timipre Sylva, the LPG sector aligns as an industry with this executive posturing to galvanize the entire LPG value chain to drive a groundswell adoption of LPG in spurring growth and improving the wellbeing of households across Nigeria.</span></p><p dir=\"ltr\"><span><br></span></p><p dir=\"ltr\"><span>The conference&#8217;s programme includes keynote addresses, presentations, and panel discussions expected to be delivered by Nigeria&#8217;s Former President, Olusegun Obasanjo GCFR, the Vice President of the Federal Republic of Nigeria, Professor Yemi Osinbajo, SAN, GCON, the Honourable Minister of State for Petroleum, Chief Timipre Sylva, the Managing Director/CEO, Nigeria LNG Limited, Africa LPG Association, international speakers, including globally ranked captains of industry who will significantly expound the global and local perspectives of the LPG market; its role in Nigeria&#8217;s accelerated recovery plan, adoption and acceptance strategies for LPG and identify solutions to bridge supply and infrastructure financing gaps in the gas value chain, among other insights.</span></p><p dir=\"ltr\"><span><br></span></p><p dir=\"ltr\"><span>For participation and sponsorship details please contact the Secretariat:&#160;<strong>olakunleoyebanjo@nigerialpgas.com</strong>&#160;or contact&#160;<strong>0803 978 9876, 0902 222 2226, 0818 253 7351</strong>&#160;for further information.</span></p>",
        "short_description": "The Nigeria Liquefied Petroleum Gas Association (NLPGA) will host its 11th Annual LPG International Conference",
        "image_thumbnail": "public/fileupload/WFmubrvLSU6bjr5rKWNvsKqEZJsoYCm3gpK3kIQ6.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "nlpga-set-to-host-nigeria-and-africa-at-its-11th-international-conference-and-exhibition-2nd-virtual-edition",
        "display_status": "Published",
        "created_at": "2023-07-09 13:26:59",
        "updated_at": "2023-07-16 16:35:47"
    },
    {
        "id": 6,
        "title": "NLPGA and Gas Academy organised 2nd West Africa LPG EXPO and NLPGA Summit.",
        "description": "<p><span>After the successful completion of the 1st West Africa LPG Nigeria Forum and Exhibition held at Eko Hotel, Lagos which attracted more than 600 participants over 2 days, the second edition of this event was held on the 23rd &#8211; 24th June 2022 at the stunning Balmoral Exhibition Centre within the Federal Palace Hotel, Lagos. Visitors were able to attain momentous insight into the LPG market and network with more than 3,000 LPG professionals across the value chain.</span></p><p>&#160;</p><p><span>Nigeria is one of the fastest-growing LPG markets with more than 20% average growth per annum for the past 10 years. In 2020, Nigeria recorded a national LPG consumption of 89.91 thousand MT (PPPRA, 2020), which is more than the 5 million consumption targets from 2018 to 2022.</span></p><p>&#160;</p><p><span>Nigeria is also one of the largest markets for new LPG cylinders and equipment. The former President of Nigeria LPG Association (NLPGA), Mr Nuhu Yakubu divulged that LPG penetration would increase from the current 7.5 million cylinders to 10 million cylinders yearly.</span></p><p><span>Nigeria&#8217;s LPG market definitely holds incredible potential post-Covid-19 and will be positioned as the golden emerging market in 2022. With massive LPG consumption growth comes the need for new LPG equipment to meet new demands and replace existing equipment.</span></p><p>&#160;</p><p><span>Special thanks to the Nigeria LP Gas Association, Gas Academy and industry stakeholders who made the event rich in thought leadership and industry-focused discussions. In attendance was former president Olusegun Obasanjo, upper ranking government officials, industry leaders, and highly acclaimed international consultants and stakeholders who spoke on contentious topics and exchange unique strategies. The theme for this year is &#8220;Energising the Future: LPG as a Sustainable Fuel in African Economies&#8221;.</span></p><p><span>The partners invited all stakeholders to be at the epicentre of Nigeria&#8217;s LPG discussion in the post-Covid-19 economic landscape. Delegates attained exclusive information on the latest technologies, new market dynamics, and business visions through panel discussions, and peer-reviewed studies. The conference also gather all the major stakeholders of the LPG industry in West Africa.</span></p>",
        "short_description": "After the successful completion of the 1st West Africa LPG Nigeria Forum and Exhibition held at Eko Hotel",
        "image_thumbnail": "public/fileupload/CnA53tPmY0QueCnMCiooIZvsU0KMjWHm34GumSPV.png",
        "views_count": 0,
        "notes": null,
        "slug": "nlpga-and-gas-academy-organised-2nd-west-africa-lpg-expo-and-nlpga-summit",
        "display_status": "Published",
        "created_at": "2023-07-09 13:24:49",
        "updated_at": "2023-07-16 16:32:54"
    },
    {
        "id": 4,
        "title": "15 years anniversary of Domestic LPG Scheme",
        "description": "<p>The 15th Anniversary of Domestic LPG Scheme will hold on <b>25th &#8211; 26th October,</b> 2022 at the Eko Hotel Plot 1415 Adetokunbo Ademola Street, Victoria Island, Lagos Nigeria. The theme for the conference is &#8216;15 Years of Domestic LPG Supply Intervention: Looking Back &amp; Looking Forward&#8217; The conference will offer at least 500 delegates / non-delegates, speakers, exhibitors and special guests opportunities for high-level networking, business match-making and learning.</p><p><br></p><p>The conference traditionally sets an agenda for engagement by parties in government, business, policy, industry and operations. Speaking at this event will be key stakeholders in the international and African LPG sector.</p><p><br></p><p><br></p><p><br></p><p>Registration is on going at&#160;<a href=\"https://reg.nlpgaconference.com/\" target=\"_blank\">https://reg.nlpgaconference.com/</a></p><p><br></p><p>For more enquiries, email : <b>info@nigerialpgas.com</b> or call <b>08170312909</b></p>",
        "short_description": "The 15th Anniversary of Domestic LPG Scheme will hold on 25th – 26th October",
        "image_thumbnail": "public/fileupload/1apUnRS6OZZ7BFEVBiPA2iPCEpSHvTSozTc8KWMU.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "how-to-make-money-online",
        "display_status": "Published",
        "created_at": "2023-07-06 11:53:31",
        "updated_at": "2023-07-16 16:29:14"
    },
    {
        "id": 2,
        "title": "OVH ENERGY ‘TEENS CAN COOK’ GRAND FINALE",
        "description": "<p class=\"MsoNormal\">OVH Energy Hosts Grand Finale of Its 2016/2017 O-Gas Teens Can Cook Competition</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">Lagos, Nigeria, <b>March 3, 2017</b> &#8211; OVH Energy Marketing, licensee of the Oando retail brand has concluded its cross regional Teens can cook competition. The O-Gas teens can cook competition, sponsored by the Nigerian Bottling Company (NBC) is part of the leading oil retailers initiatives to create awareness on the health, environmental and socio-economic benefits of adopting the use of Liquefied Petroleum Gas (LPG) in cooking.</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">The event which held at the University of Lagos multi-purpose hall recently saw guests and the shortlisted schools gather together anticipating the results of a year of passion, hard work and dedication displayed by the students. The 2016/2017 edition of the O-gas teens can cook competition kicked off with 40 schools from all 4 geopolitical regions across Nigeria and was narrowed down to eight schools across Lagos, Abuja, Port Harcourt and Benin City.</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">The grand finale showcased the culinary skills of passionate students from the final 8 schools. It also displayed the intelligence of the teens with an educational debate competition themed &#8220;Cooking gas: An enabler for environmental sustainability.&#8221;</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">Commenting on the O-Gas teens can cook initiative, Mrs. Olaposi Williams, Acting CEO of OVH Energy Marketing Limited stated &#8220;OVH Energy&#8217;s aim is to enlighten the future generation at an early age on the myriad health and environmental benefits of the adoption of LPG, and we wanted to do this by involving the teenagers in activities which would be educative as well as interesting&#8221;.&#160; Olaposi commended the efforts of the participating schools noting that the skill, intelligence and zeal displayed by the teenagers was very inspiring.&#160;</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">The contestants at the cooking competition were challenged to prepare one of Nigerians favorite dishes, Fried rice and chicken within 45 minutes. Participants were judged on preparation, taste, presentation/creativity and cleanliness of the food. Amongst the judges was the founder and head chef of Red Dish culinary school, Chef Stone, National Account Director Nigerian Bottling Company, Mrs Adeyanju Olomola and CEO and certified Nutritionist, Rubs and sauces, Mrs. Yemi Adeosun.</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">After an aromatic battle, Emmanuella Walison from Niger Delta Science School came out victorious as the winner of the 2016/2017 O-gas teens can cook competition. Commenting on the win, Emmanuella expressed her happiness saying &#8220;I never dreamt of the opportunity to show my cooking talent in a big competition like O-gas teens can cook but OVH Energy made it possible&#160; cooking is my passion and winning is the icing on the cake. &#8220;</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">Whilst the cooking competition was under way, the teenage debaters fiercely highlighted the benefits of adopting LPG and the health and environmental hazards faced when cooking with conventional biomass like kerosene and firewood. Judged by the President, Nigeria Liquefied Petroleum Gas Association, Dayo Adesina; Facilities Manager, OVH Energy, Mr Akingbogun Akinkunmi, and Head legal and company secretary OVH Energy Marketing, Mrs. Adaeze Nwakobi the debate ended with Ugoaja Chizobam from Jesuit Memorial College Port Harcourt taking home the first place prize.</p><p class=\"MsoNormal\"><br></p><p class=\"MsoNormal\">In her closing remarks, Mrs Olaposi Williams explained that the initiatives are part of OVH Energy Marketing&#8217;s plan to support the millennium development goal of ensuring environmental sustainability, by educating people on the hazards of their chosen methods of cooking but most importantly the undeniable benefits of LPG over these cooking methods. Mrs. Williams also sighted the OVH Energy Marketing NYSC Inter-platoon competition as another strategy to proliferate the importance of LPG.</p>",
        "short_description": "OVH Energy Hosts Grand Finale of Its 2016/2017 O-Gas Teens Can Cook Competition",
        "image_thumbnail": "public/fileupload/WSf1ABIjsS2pSkh0JInwNPxzZ1MNMHkAhalQlXnN.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "fg-removes-fuel-subsidy",
        "display_status": "Published",
        "created_at": "2023-07-01 21:43:24",
        "updated_at": "2023-07-16 16:26:09"
    },
    {
        "id": 1,
        "title": "LPG – BRIDGING THE ENERGY TRANSITION... Countdown To the NLPGA 13th INTERNATIONAL CONFERENCE AND EXHIBITION.",
        "description": "The Nigeria Liquefied Petroleum Gas Association (NLPGA) has set a plan in motion to play a crucial part in helping the Federal Government bridge the energy transition gap in Nigeria. To this end the association will be using it's 13th annual conference and exhibition to host dialogue and proffer solutions on using the LPG to boost the energy transition gap.<div><br></div><div><div>The NLPGA for 13 years has consistently held an annual international conference which is the&#160;</div><div>premier industry event that brings together major players in one location. The conference in 2022&#160;<span>in collaboration with the Nigeria LNG Limited (NLNG) celebrated the 15th year anniversary of&#160;</span><span>uninterrupted supply of domestic LPG in the country. The intervention saw supply of LPG grow&#160;</span><span>from 60,000MT in 2007 to over 1.3million MT in 2021 (a growth of over 1,000%). This scheme&#160;</span><span>has encouraged massive investments in LPG infrastructure and created over 150,000 jobs in the&#160;</span><span>sector.</span></div></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>This year&#8217;s conference offers opportunities to build relationships with industry participants and&#160;<span>gain knowledge of the unique financing, insurance cover and other business enabling requirements&#160;</span><span>of the sector. This year, 2023, the Conference and Exhibition will hold on November 7th and 8th at&#160;</span><span>the Petroleum Technology Development Fund Towers in Abuja, FCT. The theme of this year&#8217;s&#160;</span><span>event is <b>&#8220;LPG: Bridging the Energy Transition.&#8221;</b></span></div><div>The Energy Transition is unfolding in Nigeria and the NLPGA as it has done for several years at&#160;</div><div>our past conferences, shared the huge potentials and opportunities that lay with the usage of LPG.&#160;<span>Sessions that will be discussed by industry experts include Autogas as the Alternative to Fuel&#160;</span><span>Subsidy which is a germane issue in our national discuss currently; Recommendations for Autogas&#160;</span><span>Policy and Rollout; Technology in LPG: Opportunities for the Youth; Lifestyle Impact and&#160;</span><span>Economic Empowerment for Women as discussed by Women In LPG; Identifying financial&#160;</span></div><div>incentives for the Decade of Gas; the Petroleum Industry Act: Multiplier Effects in LPG Sector;&#160;</div><div>LPG: Boosting Revenues - Adding Weight (Sales), Cutting Losses.</div><div><br></div><div><div>These sessions will serve as sub themes to further drive home the main theme of the Conference,&#160;<span>LPG: Bridging the Energy Transition. This is an interesting time in the Gas industry particularly&#160;</span><span>in the country. PwC Nigeria, estimates that economic activities stimulated by the domestic&#160;</span><span>utilization of Nigeria's recoverable proven gas reserves has the potential to generate a Gross Value&#160;</span><span>Add (GVA) of $18.3 billion yearly to the domestic economy and $10.5 billion through direct&#160;</span><span>economic value addition with LPG contributing $1.3billion and its excess allied components&#160;</span><span>Propane and Butane contributing a further $2billion of this, which is in comparison to generating&#160;</span><span>annual export value of US$7 billion. Harnessing the country's proven reserves for domestic&#160;</span><span>utilization can also support 6.5 million full-time equivalent jobs yearly. The unification of the Naira with the new Federal Government&#8217;s foreign exchange policy will in&#160;</span></div><div>the long run also helps the Gas industry with increased Foreign Direct Investments from investors&#160;<span>who will be willing to exploit the opportunities available in the sector with the full confidence of&#160;</span><span>being able to repatriate their profits.</span></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>The need to further explore usage of LPG other than for cooking will further be thrown open with&#160;<span>the rising cost of old fuels like diesel and petrol; alongside the rapidly increasing traditional form&#160;</span><span>of energy generation through electricity as Service Based Tariffs for electricity guided by the&#160;</span><span>Nigerian Electricity Regulatory Commission (NERC) is expected to increase from reports based&#160;</span><span>on reactions from floating of the naira and a spike in inflation.&#160;</span></div><div><span><br></span></div><div><span><div>To be able to cope with the increased awareness and demand for LPG, the association is investing&#160;<span>in research and training for the industry. At the 2022 conference to mark the Domestic LPG&#160;</span><span>Supply Scheme, the NLPGA unveiled to the public its training and resource Centre project which&#160;</span><span>when completed will provide over 30 areas of study in a curriculum based on the field of Gas&#160;</span><span>operations, usage, safety and more.&#160;</span></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>Globally and in Nigeria, gas is the fastest growing segment of the petroleum industry. In Nigeria,&#160;<span>LPG utilization has grown over 2000% between 2007 when the federal government led a purpose&#160;</span><span>driven intervention by domestic LPG producers and 2022. The LPG industry&#8217;s annual turnover in&#160;</span><span>2022 was over N1,000,000,000 (one trillion naira). The industry is expected to continue growing&#160;</span><span>strongly given the Federal Government&#8217;s &#8220;Decade of Gas&#8221; policy, announced in 2021. Further, the&#160;</span><span>opportunities created by the subsidy removal would provide further growth impetus since LPG&#160;</span><span>remains the most available alternative fuel in the automotive and industrial sector. Seven out of&#160;</span><span>the largest ten car manufacturers produce LPG run vehicles and more than 27 million vehicles&#160;</span><span>globally run on it, a growth of 40% in the last decade.</span></div><div>The NLPGA, in furtherance of its belief in the versatility of LPG has also released a joint document&#160;<span>with the Nigerian Gas Association, the Association of Local Distributors of Gas and the Lagos&#160;</span><span>Chamber of Commerce and Industry (LCCI) LPG Group; that seeks to further explain what&#160;</span><span>engines can use Auto gas, the various types of Autogas, Commercial benefits of Autogas and&#160;</span><span>proposed palliatives that the Government can embrace and offer to the populace.</span></div><div><br></div><div><div>Member companies of the NLPGA across Nigeria who will be at the Annual Conference &amp;&#160;&#160;<span>Exhibition on November 7th and 8th at the PTDF in Abuja can be consulted before the Conference&#160;</span><span>and have the needed competencies to deliver on the switch and can provide ready made solutions&#160;</span><span>with a firm conviction that most petrol or diesel engines can be fitted with conversion kit, a&#160;</span><span>constant message the association has shared at previous events.</span></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>The advantages of usage of LPG are not only finance based but also environmentally driven with&#160;<span>LPG generating less carbon-dioxide and nitrogen-oxide emissions than petrol and diesel engines&#160;</span><span>because LPG produces 90% less carbon monoxide and 50% less smog than natural gas. It also&#160;</span><span>evaporates on its own, eliminating environmental risks if there are spillages, just as it doesn&#8217;t cause&#160;</span><span>any black smoke from the exhaust. The NLPGA has reiterated like other association&#8217;s in the energy sector that Nigeria is a country&#160;</span><span>with more gas than oil. We currently have about 206 trillion cubic feet of gas reserves. The&#160;</span><span>government should tap into the alternate use of gas as a cheaper fuel for transportation by&#160;</span><span>augmenting the conversion for at least one million vehicles, two million tricycles, and five million&#160;</span><span>generators over the next three months. On a cost analysis, vehicle users can save N40 per kilometer,&#160;</span><span>10-15 per kilometer for tricycles, and N500/HR for generators.&#160;</span></div><div><span><br></span></div><div><span><div>The NLPGA has members across the country in different categories of the LPG value chain with&#160;<span>growing facilities and expansion programs that can cater to the LPG Autogas and Industrial needs&#160;</span><span>of Nigeria in collaboration with the Federal Government.</span></div><div><span><br></span></div><div><span><br></span></div><h4><b>Felix Ekundayo</b></h4><div>President, Nigeria Liquefied Petroleum Gas Association.</div></span></div></font></span></div></div></font></span></div></span></div></font></span></div></div></font></span></div>",
        "short_description": "The Nigeria Liquefied Petroleum Gas Association (NLPGA) has set a plan in motion to play a crucial part in helping the Federal Government bridge the energy transition gap in Nigeria.",
        "image_thumbnail": "public/fileupload/ep4ghy5CrA1S7Y8gLrOYSCJBXwcBOUDlH4cFUTKr.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "what-is-lorem-ipsum",
        "display_status": "Published",
        "created_at": "2023-07-01 21:34:18",
        "updated_at": "2023-07-10 15:06:13"
    }
]