[
    {
        "id": 5,
        "title": "NLPGA 13th INTERNATIONAL CONFERENCE AND EXHIBITION",
        "description": "<p><span>The Nigeria Liquefied Petroleum Gas Association (NLPGA) has set a plan in motion to play a crucial part in helping the Federal Government bridge the energy transition gap in Nigeria. To this end the association will be using it's 13th annual conference and exhibition to host dialogue and proffer solutions on using the LPG to boost the energy transition gap.</span></p><div><br></div><div><div>The NLPGA for 13 years has consistently held an annual international conference which is the&#160;</div><div>premier industry event that brings together major players in one location. The conference in 2022&#160;<span>in collaboration with the Nigeria LNG Limited (NLNG) celebrated the 15th year anniversary of&#160;</span><span>uninterrupted supply of domestic LPG in the country. The intervention saw supply of LPG grow&#160;</span><span>from 60,000MT in 2007 to over 1.3million MT in 2021 (a growth of over 1,000%). This scheme&#160;</span><span>has encouraged massive investments in LPG infrastructure and created over 150,000 jobs in the&#160;</span><span>sector.</span></div></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>This year&#8217;s conference offers opportunities to build relationships with industry participants and&#160;<span>gain knowledge of the unique financing, insurance cover and other business enabling requirements&#160;</span><span>of the sector. This year, 2023, the Conference and Exhibition will hold on November 7th and 8th at&#160;</span><span>the Petroleum Technology Development Fund Towers in Abuja, FCT. The theme of this year&#8217;s&#160;</span><span>event is&#160;<span>&#8220;LPG: Bridging the Energy Transition.&#8221;</span></span></div><div>The Energy Transition is unfolding in Nigeria and the NLPGA as it has done for several years at&#160;</div><div>our past conferences, shared the huge potentials and opportunities that lay with the usage of LPG.&#160;<span>Sessions that will be discussed by industry experts include Autogas as the Alternative to Fuel&#160;</span><span>Subsidy which is a germane issue in our national discuss currently; Recommendations for Autogas&#160;</span><span>Policy and Rollout; Technology in LPG: Opportunities for the Youth; Lifestyle Impact and&#160;</span><span>Economic Empowerment for Women as discussed by Women In LPG; Identifying financial&#160;</span></div><div>incentives for the Decade of Gas; the Petroleum Industry Act: Multiplier Effects in LPG Sector;&#160;</div><div>LPG: Boosting Revenues - Adding Weight (Sales), Cutting Losses.</div><div><br></div><div><div>These sessions will serve as sub themes to further drive home the main theme of the Conference,&#160;<span>LPG: Bridging the Energy Transition. This is an interesting time in the Gas industry particularly&#160;</span><span>in the country. PwC Nigeria, estimates that economic activities stimulated by the domestic&#160;</span><span>utilization of Nigeria's recoverable proven gas reserves has the potential to generate a Gross Value&#160;</span><span>Add (GVA) of $18.3 billion yearly to the domestic economy and $10.5 billion through direct&#160;</span><span>economic value addition with LPG contributing $1.3billion and its excess allied components&#160;</span><span>Propane and Butane contributing a further $2billion of this, which is in comparison to generating&#160;</span><span>annual export value of US$7 billion. Harnessing the country's proven reserves for domestic&#160;</span><span>utilization can also support 6.5 million full-time equivalent jobs yearly. The unification of the Naira with the new Federal Government&#8217;s foreign exchange policy will in&#160;</span></div><div>the long run also helps the Gas industry with increased Foreign Direct Investments from investors&#160;<span>who will be willing to exploit the opportunities available in the sector with the full confidence of&#160;</span><span>being able to repatriate their profits.</span></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>The need to further explore usage of LPG other than for cooking will further be thrown open with&#160;<span>the rising cost of old fuels like diesel and petrol; alongside the rapidly increasing traditional form&#160;</span><span>of energy generation through electricity as Service Based Tariffs for electricity guided by the&#160;</span><span>Nigerian Electricity Regulatory Commission (NERC) is expected to increase from reports based&#160;</span><span>on reactions from floating of the naira and a spike in inflation.&#160;</span></div><div><span><br></span></div><div><span><div>To be able to cope with the increased awareness and demand for LPG, the association is investing&#160;<span>in research and training for the industry. At the 2022 conference to mark the Domestic LPG&#160;</span><span>Supply Scheme, the NLPGA unveiled to the public its training and resource Centre project which&#160;</span><span>when completed will provide over 30 areas of study in a curriculum based on the field of Gas&#160;</span><span>operations, usage, safety and more.&#160;</span></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>Globally and in Nigeria, gas is the fastest growing segment of the petroleum industry. In Nigeria,&#160;<span>LPG utilization has grown over 2000% between 2007 when the federal government led a purpose&#160;</span><span>driven intervention by domestic LPG producers and 2022. The LPG industry&#8217;s annual turnover in&#160;</span><span>2022 was over N1,000,000,000 (one trillion naira). The industry is expected to continue growing&#160;</span><span>strongly given the Federal Government&#8217;s &#8220;Decade of Gas&#8221; policy, announced in 2021. Further, the&#160;</span><span>opportunities created by the subsidy removal would provide further growth impetus since LPG&#160;</span><span>remains the most available alternative fuel in the automotive and industrial sector. Seven out of&#160;</span><span>the largest ten car manufacturers produce LPG run vehicles and more than 27 million vehicles&#160;</span><span>globally run on it, a growth of 40% in the last decade.</span></div><div>The NLPGA, in furtherance of its belief in the versatility of LPG has also released a joint document&#160;<span>with the Nigerian Gas Association, the Association of Local Distributors of Gas and the Lagos&#160;</span><span>Chamber of Commerce and Industry (LCCI) LPG Group; that seeks to further explain what&#160;</span><span>engines can use Auto gas, the various types of Autogas, Commercial benefits of Autogas and&#160;</span><span>proposed palliatives that the Government can embrace and offer to the populace.</span></div><div><br></div><div><div>Member companies of the NLPGA across Nigeria who will be at the Annual Conference &amp;&#160;&#160;<span>Exhibition on November 7th and 8th at the PTDF in Abuja can be consulted before the Conference&#160;</span><span>and have the needed competencies to deliver on the switch and can provide ready made solutions&#160;</span><span>with a firm conviction that most petrol or diesel engines can be fitted with conversion kit, a&#160;</span><span>constant message the association has shared at previous events.</span></div><div><span><br></span></div><div><span><font face=\"Roboto, sans-serif\"><div>The advantages of usage of LPG are not only finance based but also environmentally driven with&#160;<span>LPG generating less carbon-dioxide and nitrogen-oxide emissions than petrol and diesel engines&#160;</span><span>because LPG produces 90% less carbon monoxide and 50% less smog than natural gas. It also&#160;</span><span>evaporates on its own, eliminating environmental risks if there are spillages, just as it doesn&#8217;t cause&#160;</span><span>any black smoke from the exhaust. The NLPGA has reiterated like other association&#8217;s in the energy sector that Nigeria is a country&#160;</span><span>with more gas than oil. We currently have about 206 trillion cubic feet of gas reserves. The&#160;</span><span>government should tap into the alternate use of gas as a cheaper fuel for transportation by&#160;</span><span>augmenting the conversion for at least one million vehicles, two million tricycles, and five million&#160;</span><span>generators over the next three months. On a cost analysis, vehicle users can save N40 per kilometer,&#160;</span><span>10-15 per kilometer for tricycles, and N500/HR for generators.&#160;</span></div><div><span><br></span></div><div><span><div>The NLPGA has members across the country in different categories of the LPG value chain with&#160;<span>growing facilities and expansion programs that can cater to the LPG Autogas and Industrial needs&#160;</span><span>of Nigeria in collaboration with the Federal Government.</span></div><div><span><br></span></div><div><span><br></span></div><h4><span>Felix Ekundayo</span></h4><div>President, Nigeria Liquefied Petroleum Gas Association.</div></span></div></font></span></div></div></font></span></div></span></div></font></span></div></div></font></span></div>",
        "short_description": "The Nigeria Liquefied Petroleum Gas Association (NLPGA) has set a plan in motion to play a crucial part in helping the Federal Government bridge the energy transition gap in Nigeria.",
        "image_thumbnail": "public/fileupload/uVxErAdhBcc5Wk0JqOHsGprE0UhruCaZusgthURu.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "tester-press-release",
        "display_status": "Published",
        "created_at": "2023-07-06 22:49:49",
        "updated_at": "2023-07-12 00:29:39"
    },
    {
        "id": 3,
        "title": "PRESIDENT’S REPORT AT THE NLPGA ANNUAL GENERAL MEETING (AGM) OF MEMBERS OF NIGERIA LIQUEFIED PETROLEUM GAS ASSOCIATION",
        "description": "<p class=\"MsoNormal\"><b><i><span>DATE:</span></i></b><b><i><span>&#160;</span></i></b><b><i><span>JUNE 27, 2023<br>&#10;</span></i></b><b><i><span>VENUE:&#160;AMBER RESIDENCE HALL, IKEJA&#10;GRA, LAGOS.&#160;</span></i></b><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>It is my honour and&#10;pleasure to present this report for our activities from June 2022 till date. We&#10;thank God for the gift of life and sustained businesses despite the global&#10;economic instability, the effects of the Russian-Ukraine war and, closer to home,&#10;an election period with associated uncertainties and the transition of&#10;government.</span><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>During the year under review, to be&#10;specific in November 2022, we lost a member, Engr. Temidayo Isaac Omotope,&#10;former MD of Anchor Petroleum Limited. May his soul rest in peace!</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>It behoves me to say that these are&#10;interesting times for our industry despite the various challenges and&#10;obstacles, wherein lie opportunities for our members&#8217; businesses. The new&#10;government has implemented in rapid order some major policy changes, notably:</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<ol start=\"1\" type=\"1\">&#10; <li class=\"MsoNormal\"><b><span>Subsidy removal&#10;     on petrol,&#160;</span></b><span>which&#10;     has created the necessity for the public and industries to look at&#10;     alternative means of fuel for transportation;</span></li>&#10; <li class=\"MsoNormal\"><span>Ongoing&#10;     unification of foreign exchange markets, which in theory should in the&#10;     long term encourage foreign direct investments (on this we are hopeful);&#10;     and</span></li>&#10; <li class=\"MsoNormal\"><span>A likely raising&#10;     of electricity tariffs, which is intended to help boost electricity&#10;     generation and access to more reliable power supply and may increase the&#10;     need for consumers to look for other sources of fuel for generating&#10;     electricity.</span></li>&#10;</ol>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>All of the above we&#10;consider to be opportunities for our stakeholders, if managed well.&#160; More&#10;on this later.</span><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>Last year&#8217;s AGM&#10;ushered a new NLPGA Executive Committee (Exco) which you elected to run the&#10;affairs of this Association, with broad support from the Governing&#10;Council.&#160; In the same year, we also engaged a new Executive&#10;Secretary.&#160; In July 2022 the new Exco embarked on preparations for the&#10;2022 annual Conference, which coincided with a seminal year marking the 15th&#10;anniversary of the Domestic LPG supply intervention scheme.&#160; With the&#10;support of members, the Governing Council and our partners for the event,&#10;Nigeria LNG Limited (NLNG), we were able to deliver a very successful event.</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>This Exco has arranged&#10;physical and online engagements, negotiated collaborations and agreements, and&#10;has actively promoted the Association&#8217;s value add to our members and to&#10;industry stakeholders at large.&#160; In the course of the year since our last&#10;AGM, we have:</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<ol start=\"1\" type=\"1\">&#10; <li class=\"MsoNormal\"><span>Signed an MOU&#10;     with the Federal Road Safety Corps (FRSC).&#160; This is an important&#10;     public service designed to train FRSC staff in batches across the&#10;     country.&#160; The idea is to build capacity for Corp officers on&#10;     effective monitoring of mobile assets transporting LPG, in order to&#10;     further reduce the hazards associated with gas transportation even as we&#10;     are set to see a substantial increase in same.&#160; Your Association sees&#10;     this as an important Corporate Social Responsibility activity, which will&#10;     be beneficial for not just our businesses but the country as a whole.</span></li>&#10; <li class=\"MsoNormal\"><span>Commenced a&#10;     campaign to increase awareness for the construction industry to&#10;     incorporate into their designs safe usage of gas for activities other than&#10;     cooking e.g. cooling, water heating and power generation. This led us into&#10;     a collaboration with the Nigeria Institute of Architects (NIA) who&#10;     participated in our last conference and also extended an invitation to the&#10;     NLPGA to participate at the NIA&#8217;s Annual Conference and Exhibition.&#160;&#10;     We thank those member companies who participated to help promote the&#10;     spread of the safe use of gas.</span></li>&#10; <li class=\"MsoNormal\"><span>Grown our&#10;     membership base and continue to engage them and the general public&#10;     regularly.</span></li>&#10; <li class=\"MsoNormal\"><span>Organized a&#10;     dedicated session for students and young professionals during the&#10;     &#34;15th anniversary of Domestic LPG in Nigeria&#34; conference, in&#10;     collaboration with NLNG.&#160; The session received excellent feedback&#10;     from over 40 students and young professionals in attendance.</span></li>&#10; <li class=\"MsoNormal\"><span>Provided&#10;     complimentary membership subscription coverage for a period of 2 years to&#10;     24 student members who paid and registered to attend the conference.&#160;&#10;     Within this cadre, we conducted a highly impactful Domestic LPG safety&#10;     training exclusively for student members, which was well received.</span></li>&#10; <li class=\"MsoNormal\"><span>Invitation to&#10;     and participation at the Nigeria International Energy Summit (NIES) in&#10;     April 2023 where we put our industry views across to a high level&#10;     audience.</span></li>&#10;</ol>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>Specific Activities&#10;of the NLPGA Executive Committee are reported under our various Committees as&#10;below:</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><b><span>Membership&#10;&amp; Mentorship Committee</span></b><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>The Association&#10;admitted a total of 37 new members, which includes 13 companies and 24 student&#10;members.&#160; The Committee has been engaged in regular engagement with&#10;members, which has resulted in a reduction in our receivables.</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><b><span>Finance&#10;Committee</span></b><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>The funds generated&#10;by the Association from 1st July 2022 to 30th June 2023 are as follows:</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>Conference:&#160;&#10;&#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160;&#10;&#160; &#160; &#160; &#160; &#160; &#160; &#160;NGN102,886,523.18<br>&#10;Training:&#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160;&#10;&#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160;&#10;&#160;NGN7,545,026.88<br>&#10;Membership Subscription:&#160; &#160; &#160; &#160; &#160; &#160; &#160;NGN11,748,865.95<br>&#10;Advertisement Income:&#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160;&#10;&#160;&#160;NGN2,015,000.00<br>&#10;Total:&#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160;&#10;&#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160; &#160;&#10;&#160; &#160; &#160; &#160;NGN124,195,146.01</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>In addition, the&#10;association converted and saved $30,000 worth of Naira at the old exchange rate&#10;into our domiciliary account.&#160; This increased the fixed deposit from&#10;$51,000 to $81,000.</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><b><span>Publicity&#10;&amp; Awareness Committee</span></b><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>We have consistently&#10;published our monthly newsletter, which is proving to be a great outreach to&#10;stakeholders.&#160; We have also maintained high levels of visibility in&#10;traditional and digital media, and have revamped the Association&#8217;s website to&#10;make it more functional and accessible.&#160; Members feedback is highly&#10;welcome.</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><b><span>Legal&#10;&amp; Compliance Committee</span></b><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>We continue to&#10;monitor our on-going litigations, namely:</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<ol start=\"1\" type=\"1\">&#10; <li class=\"MsoNormal\"><span>NLPGA vs. PPPRA&#10;     &#8211; currently on a motion to substitute the defendant from PPPRA to NMDPRA.</span></li>&#10; <li class=\"MsoNormal\"><span>NLPGA vs. FIRS -&#10;     the FIRS has requested to regularize its response to our suit.</span></li>&#10; <li class=\"MsoNormal\"><span>NLPGA vs.&#10;     NALPGAM - the substantive suit adjourned.</span></li>&#10; <li class=\"MsoNormal\"><span>NALPGAM vs.&#10;     NLPGA &#8211; we have brought this before the court for it to be struck out on&#10;     the basis of lack of appearance by NALPGAM on several occasions, they&#10;     being the originator.</span></li>&#10;</ol>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><b><span>Our&#10;planned activities for the near future include:</span></b><span></span></p>&#10;&#10;<ol start=\"1\" type=\"1\">&#10; <li class=\"MsoNormal\"><span>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; We have coordinated a coalition&#10;     of Gas Associations to manage the narrative around gas utilization,&#10;     covering not just LPG but also natural gas in various forms.&#160;&#10;     Alongside the Nigeria Gas Association (NGA), the Association of Local&#10;     Distributors of Gas and the Lagos Chamber of Commerce and Industry (LCCI)&#10;     LPG Group, the NLPGA released a guide that seeks to clarify the various&#10;     types of Autogas, commercial benefits of Autogas and proposed palliatives&#10;     that the Government can embrace and offer to the populace.&#160; It is one&#10;     thing to speak and understand Autogas, it is quite another to&#10;     execute.&#160; Without infrastructure the development of Autogas in&#10;     Nigeria will be stunted.&#160; To this end, NLPGA will be driving the&#10;     narrative and seeking even broader support from the white products&#10;     Associations and stakeholders such as: MOMAN, IPMAN, DAPMAN and&#10;     PETROAN.&#160; We need broad industry collaboration, so as not to confuse&#10;     the public and consumers at large but rather educate and support them to&#10;     ensure they make informed decisions on gas.</span></li>&#10; <li class=\"MsoNormal\"><span>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; A seminar, which will be&#10;     conducted by the Legal and Compliance committee, which seeks to engage&#10;     lawyers and regulators to explain to members who choose to attend various&#10;     regulations and their implications on our members&#8217; businesses, as well as&#10;     possible rights that member businesses have as outlined in the laws.&#160;&#10;     This is to avoid the growing threat of exploitation by some elements in&#10;     regulatory bodies and various MDAs.</span></li>&#10; <li class=\"MsoNormal\"><span>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; At last year&#8217;s Conference, we&#10;     had a presentation where the NLPGA Training and Resource Centre project was&#10;     unveiled. We are approaching government and its Agencies as well as you&#10;     our members to support the project. When completed, the Centre will&#10;     provide great resource for the industry with over 30 areas of study in a&#10;     curriculum based on the field of Gas operations, usage, safety and more.</span></li>&#10; <li class=\"MsoNormal\"><span>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; Last but not least, our 13th&#10;     Annual Conference &amp; Exhibition, which will be holding at the PTDF&#10;     Towers in Abuja, seeks to further position the NLPGA with a theme that is&#10;     particularly relevant: LPG: BRIDGING OUR ENERGY TRANSITION. We look&#10;     forward to members attending in large numbers and also exhibiting their&#10;     products.&#160; This is truly set to become the decade of gas.&#160; It is&#10;     out time!</span></li>&#10;</ol>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>Finally, on behalf of&#10;the ExCo and the Governing Council, I humbly express our profound gratitude for&#10;the opportunity to be of service to this Association.&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>Thank you for your&#10;time, and God bless you all.</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><span>&#160;</span></p>&#10;&#10;<p class=\"MsoNormal\"><b><span>Felix&#10;Ekundayo</span></b><span></span></p>&#10;&#10;<p class=\"MsoNormal\"><span>President, Nigeria&#10;Liquefied Petroleum Gas Association.</span></p>&#10;&#10;<p class=\"MsoNormal\">&#160;</p>",
        "short_description": "It is my honour and pleasure to present this report for our activities from June 2022 till date",
        "image_thumbnail": "public/fileupload/VuwqIY7xGRjK2Q8rcF3n3oSsTjQNoB3siuLLIEGQ.jpg",
        "views_count": 0,
        "notes": null,
        "slug": "fg-removes-fuel-subsidy",
        "display_status": "Published",
        "created_at": "2023-07-01 21:43:24",
        "updated_at": "2023-07-04 11:24:53"
    }
]